let shop1 = [
    ["普通攻击", 10, 1, "攻击+10"],
    ["普通攻击", 10, 1, "攻击+10"],
    ["普通防御", 0, 1, "防御+10"],
    ["普通防御", 0, 1, "防御+10"],
    ["治疗回血", 0, 1, "回血+10"],
    ["治疗回血", 0, 1, "回血+10"],
    ["双重打击", 20, 1, "攻击+20"],
    ["致命一击", 0, 2, "使当前攻击力翻倍"],
    ["超级防御", 0, 2, "使当前防御翻倍"],
    ["完美防御", 0, 3, "完全抵挡所有伤害"],
    ["护盾打击", 0, 1, "护盾值也会作为伤害攻击"],
    ["危险进攻", 30, 2, "造成30伤害但自身也会受伤-5"],
    ["免费重置", 0, 0, "免费重置商店"],
    ["补充能量", 0, 0, "恢复一点能量"],
]

let power1 = [
    ["圣杯国王", "永久提升50血量"],
    ["圣杯皇后", "每回合提升5血量"],
    ["圣杯骑士", "当你濒死时,立即获得30血量"],
    ["圣杯侍从", "当你濒死时,不会死亡"],

    ["星币国王", "如果你当前低20金币,立即获得30金币"],
    ["星币皇后", "立即获得20金币"],
    ["星币骑士", "每回合多获得5金币"],
    ["星币侍从", "三回合后获得30金币"],

    ["宝剑国王", "回合结束手中没有攻击牌，则攻击力翻倍"],
    ["宝剑骑士", "每回合提升10攻击"],
    ["宝剑皇后", "你购买的攻牌一回合后属性翻倍,上限40"],
    ["宝剑侍从", "当你一回合打出三次攻击牌,攻击力+20"],

    ["权杖国王", "每回合多获得2能量"],
    ["权杖骑士", "每回合多获得10护盾"],
    ["权杖皇后", "每回合多获得一次免费商店刷新"],
    ["权杖侍从", "5回合后获得丰富强化"],
]

let thing1 = [
    ["愚人", "恢复双方100血量"],
    ["倒吊人", "减少双方30血量"],
    ["世界", "随机变化双方血量、攻击和防御"],
    ["命运之轮", "重新开始战斗"],
    ["死神", "直接结束对局,血量多着胜"],

    ["女祭司", "随机变化自身血量、攻击和防御"],
    ["力量", "永久提升20攻击力"],
    ["战车", "该回合提升30攻击力"],
    ["隐士", "该回合提升30护盾"],
    ["太阳", "恢复自身50血量"],
    ["月亮", "每回合增加自身1能量"],
    ["节制", "每回合减少自身1能量"],
    ["教皇", "该回合增加自身3能量"],
    ["女皇", "每回合增加自身5金币"],
    ["皇帝", "增加自身30金币"],
    ["恋人", "翻倍自身全属性"],
    ["审判", "该回合初始化三倍攻击"],
    ["灯塔", "该回合boss不能操作"],
    ["星星", "强化多获得一次刷新"],

    ["恶魔", "boss全属性翻倍"],
    ["魔术师", "随机变化boss血量、攻击和防御"],
]

let mbti1 = [
    ["ISTJ","每回合多一能量"],
    ["ISFJ","每回合多10攻击"],
    ["INFJ","每回合多10护盾"],
    ["INTJ","每回合恢复3血量"],
    ["ISTP","每回合多3金币"],
    ["ISFP","回合开始多20金币"],
    ["INFP","强化多获得一次刷新"],
    ["INTP","全属性+5"],
]

let xingzuo1 = [
    ["巨蟹座", "暂无强化"],
    ["双鱼座", "每回合减少你1能量"],
    ["金牛座", "每回合减少你3金币"],
    ["处女座", "每回合减少你10护盾"],
    ["天蝎座", "每回合多10攻击"],
]

let site1 = [
    ["列车站",["保安","售票员","路人1"],["保安室","售票台"],[["等候厅",["路人2","路人3","路人4"],["服务台","座位1","座位2","座位3"]],["厕所",["路人5"]]]],
    ["列车",["列车员","服务员","路人1"],["座位1","座位2","座位3"],[["车厢1",["路人2","路人3","路人4"],["座位4","座位5","座位6"]],["车厢2",["路人5","路人6","路人7"],["座位7","座位8","座位9"]],["车厢3",["路人8","路人9","路人10"],["座位10","座位11","座位12"]],["厕所",["路人11"]]]],
    ["学校",["门卫","社区工作者","学生1"],["保安室","售票台"],[["食堂",["教师1","学生2","学生3"]],["操场",["学生4","学生5","学生6"]],["厕所",[]]]],
    ["教学楼",["门卫"],["保安室","售票台"],[["教室1",["教师1","学生2","学生3"]],["教室2",[]],["教室3",["学生4"]],["教室4",["学生5"]],["教室5",["学生6"]],["厕所",[]]]],
    ["宿舍楼",["宿管阿姨"],["保安室","售票台"],[["101",["学生1","学生2","学生3"]],["102",["学生1","学生2","学生3"]],["103",["学生4"]],["104",["学生5"]],["105",[]],["厕所",[]]]],
    ["105宿舍",[],["保安室","售票台"],[["1号床",[]],["2号床",[]],["3号床",[]],["4号床",[]],["厕所",[]]]],
    ["医院",["保安","护士1","病人1"],["保安室","售票台"],[["门诊1",["医生1","病人2"]],["门诊2",[]],["门诊3",["医生2"]],["门诊4",["护士2"]],["门诊5",["病人3"]],["厕所",[]]]],
    ["教堂",["神父","信徒1","信徒2"],["保安室","售票台"],[["储藏室",[]],["后室",[]],["阁楼",[]],["厕所",[]]]],
]

let say1 = [
    ["列车站保安",["你好,我是这里的保安,有什么事跟我说就行了"],"[你违反了规则]你往哪走啊?"],
    ["列车站售票员",["你好,我是这里的售票员,你买好票了吗","今日有去春市和冬市的票","去夏市的车马上要出发了"],"[你违反了规则]你往哪走啊?"],
    ["列车站路人1",["哦?我在这等车","你也是去夏市的吗"],"[你违反了规则]你往哪走啊?"],
    ["列车站路人2",["怎么了?","我也不太清楚,要不你去服务台问问"],"[你违反了规则]你往哪走啊?"],
    ["列车站路人4",["我知道你要找什么","拿个东西跟我换"],"[你违反了规则]你往哪走啊?"],
    ["列车站路人5",["你在厕所看到了路人5","她走后","发现她遗失了一枚戒指"],"[你违反了规则]你往哪走啊?"],
    ["列车路人1",["我就知道你也是去夏市的","哈哈哈我们路上也有伴了不是","我们这么有缘,来给你一个好东西"],"[愤怒暴走]我让你拿着!"],
    ["列车服务员",["这里堆放了很多上批乘客留下来的垃圾","这收拾起来有些麻烦","有人帮帮我吗"],"[你违反了规则]你往哪走啊?"],
    ["列车列车员",["有事请找蓝色制服服务员","他们很可靠"],"[你违反了规则]你往哪走啊?"],
    ["列车路人11",["规则怎么找不到了","部分规则已经被玷污了","你有看到吗"],"[你违反了规则]你往哪走啊?"],
    ["列车路人2",["太可怕了","怎么会遇到这种事","好害怕呀"],"[你违反了规则]你往哪走啊?"],
    ["列车路人3",["对呀对呀","我们只是睡了一觉就发生这种事","真令人不安"],"[你违反了规则]你往哪走啊?"],
    ["列车路人4",["还有多长事件到站","马上到站吧","待不下去了"],"[你违反了规则]你往哪走啊?"],
    ["列车路人5",["他看起来不是正常死亡而是被杀","但是没有伤口","希望警察能调查清楚吧"],"[你违反了规则]你往哪走啊?"],
    ["列车路人6",["我知道谁是凶手","是车厢3的路人9"],"[你违反了规则]你往哪走啊?"],
    ["列车路人7",["不关我事"],"[你违反了规则]你往哪走啊?"],
    ["列车路人8",["车厢1的路人3,他在说谎"],"[你违反了规则]你往哪走啊?"],
    ["列车路人9",["真的不是我啊","我被人诬陷了,我在凌晨亲眼看到车厢1的路人4去你们车厢来着"],"[你违反了规则]你往哪走啊?"],
    ["列车路人10",["我亲眼看到你给了路人1吃了东西","你别想跑了"],"[你违反了规则]你往哪走啊?"],
]

let word1 = [
    ["列车站",
    [
        "1.等候厅是安全的,如有问题立刻前往",
        "2.保安是可信的",
    ]],
    ["列车",
    [
        "1.蓝色制服服务员是不可信的",
        "2.除了列车员,不要相信其他人",
        "3.尽量不要拒绝他人要求",
        "4.16:00之后不要随意更换车厢和座位",
    ]]
]

let thing2 = [
    ["愚人", "伪装成随机牌"],
    ["倒吊人", "失魂"],
    ["世界", "去掉规则中的一条"],
    ["命运之轮", "时间轮转,重新开始或者直接通过"],
    ["死神", "倒计时结束前完成即安全"],
    ["力量", "获得隐藏道具"],
    ["战车", "无事发生"],
    ["太阳", "时间轮转为白天"],
    ["月亮", "时间轮转为夜晚"],
    ["节制", "你已被禁止使用道具"],
    ["恋人", "随机变化时间"],
    ["审判", "免疫一次攻击"],
    ["灯塔", "暂时失去攻击欲望"],
    ["星星", "重新抽一次"],
    ["恶魔", "恶魔现身"],
]

let element1 = [
    ["火", [["烈火飞龙","召唤一条火龙,造成大量伤害"], ["火焰屏障","三回合恢复1/5最大生命值,30%控制对方"], ["火焰柱","抵挡一次伤害,灼烧对方"], ["火焰弹","50%清除对方能力上升状态"]]],
    ["水", [["深海巨鲨","造成伤害附加持续伤害"], ["水之守护","三回合恢复1/5最大生命值,30%控制对方"], ["浪涛汹涌","三回合免疫控制,获得护盾"], ["水之冲击","50%清除对方回合类效果"]]],
    ["木", [["唤星者","恢复全部元素hp和pp,只有一点次数"], ["森林庇护","四回合吸取对方1/10最大生命值"], ["万物生长","四回合免疫控制,获得护盾"], ["长者之树","50%清除并复制对方能力上升状态"]]],
    ["土", [["多尾狐","召唤一条多尾狐,造成伤害"], ["伫立之墙","三回合恢复1/5最大生命值和护盾"], ["硬化皮肤","将护盾转化固定伤害与攻击一并打出"], ["大地之怒","造成伤害并清除对方护盾"]]],
    ["电", [["十万伏特","造成伤害附加固定伤害"], ["雷电充能","二回合恢复1/5最大生命值,回合内必定暴击"], ["闪电之速","30%降低对方攻击,70%控制对方"], ["雷电千鸟","50%当对方生命值低于20%斩杀"]]],
]


module.exports = {
    shop1,
    power1,
    thing1,
    mbti1,
    xingzuo1,
    site1,
    say1,
    word1,
    thing2,
    element1,
}